Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: To setup this feature, please include the following lines in `src/main/resources/application.properties`:
ja_jp: この機能を設定するには、 `src/main/resources/application.properties` に以下の行を記述してください:

source: To share stories about Quarkus usage, we added https://github.com/quarkusio/quarkus/blob/master/ADOPTERS.md[an `ADOPTERS.md` file] at the root of the repository.
ja_jp: Quarkusの使用方法についてのストーリーを共有するために、リポジトリのルートに link:https://github.com/quarkusio/quarkus/blob/master/ADOPTERS.md[`ADOPTERS.md`] ファイルを追加しました。

source: To show the current project space, enter the following command:
ja_jp: 現在のプロジェクト・スペースを表示するには、以下のコマンドを入力します：

source: To sign the claims, you can use RSA private keys, Elliptic Curve (EC) private keys, and symmetric secret keys.
ja_jp: クレームに署名するには、RSA 秘密鍵、楕円曲線 (EC) 秘密鍵、対称シークレットキーを使用できます。

source: To simplify the use of the SunJSSE truststore, Quarkus TLS Registry provides a TLS configuration under the name `javax.net.ssl` that mimics the default behavior of SunJSSE:
ja_jp: SunJSSE トラストストアの使用を簡素化するために、Quarkus TLS レジストリーは、SunJSSE のデフォルトの動作を模倣した `javax.net.ssl` という名前の TLS 設定を提供します。

source: To simplify things, quarkus provides single step alternative:
ja_jp: 物事を単純化するために、Quarkus はシングルステップの代替手段を提供しています。

source: To skip the boilerplate definition of CRUD operations, we can use one of the available interfaces (e.g. `CrudRepository` or `BasicRepository`).
ja_jp: CRUD 操作のボイラープレートな定義をスキップするために、利用可能なインターフェース (例: `CrudRepository` や `BasicRepository`) のいずれかを使用できます。

source: To skip the scheduled executions while the application is starting up/shutting down, you can make use of the `io.quarkus.scheduler.Scheduled.ApplicationNotRunning` skip predicate.
ja_jp: アプリケーションの起動/シャットダウン中にスケジュールされた実行をスキップするには、 `io.quarkus.scheduler.Scheduled.ApplicationNotRunning` のスキップ条件を使用できます。

source: To solve the issue you can create a `proxy-config.json` file under the `src/main/resources/META-INF/native-image/<group-id>/<artifact-id>` folder. For more information about the format of the `proxy-config.json`, see the https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/metadata/#dynamic-proxy-metadata-in-json[Dynamic Proxy Metadata in JSON] documentation.
ja_jp: この問題を解決するには、`src/main/resources/META-INF/native-image/<group-id>/<artifact-id>` フォルダーの `proxy-config.json` ファイルを作成します。 `proxy-config.json` のフォーマットの詳細は、https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/metadata/#dynamic-proxy-metadata-in-json[Dynamic Proxy Metadata in JSON] ドキュメントを参照してください。

source: To solve this problem, Quarkus can also record start and end events at the beginning and end of processing. These events are disabled by default. However, we can enable these events in JFR, as described below.
ja_jp: この問題を解決するために、Quarkus は処理の開始時と終了時に開始イベントと終了イベントを記録することもできます。 これらのイベントはデフォルトでは無効化されています。 ただし、以下で説明するように、JFR でこれらのイベントを有効化できます。

source: To specify a value for `${header.value}`, simply put the following in your `application.properties`:
ja_jp: `${header.value}` に値を指定するには、 `application.properties` に単に以下のように記述します。

source: To specify paths within this context root, use a relative path that does not begin with a forward slash.
ja_jp: このコンテキストルート内のパスを指定するには、スラッシュで始まらない相対パスを使用します。

source: To specify the namespace in your manifest customize with the following property in your `application.properties`:
ja_jp: マニフェストで名前空間を指定するには、 `application.properties` の中で次のプロパティーによってカスタマイズします。

source: To stand up the Config Server required for this guide, please follow the instructions outlined https://github.com/spring-guides/gs-centralized-configuration#stand-up-a-config-server[here]. The end result of that process is a running Config Server that will provide the `Hello world` value for a configuration property named `message` when the application querying the server is named `a-bootiful-client`.
ja_jp: このガイドに必要なコンフィグサーバーを立ち上げるには、 https://github.com/spring-guides/gs-centralized-configuration#stand-up-a-config-server[こちら]で説明している手順に従ってください。そのプロセスの最終結果は、サーバーにクエリを実行するアプリケーションが `a-bootiful-client` という名前の場合、 `message` という名前の設定プロパティに `Hello world` 値を提供する実行中の設定サーバーです。

source: To start a Infinispan Server for your unit tests, Quarkus provides one `QuarkusTestResourceLifecycleManager` that relies on link:https://infinispan.org/docs/stable/titles/hotrod_java/hotrod_java.html#junit-testing[Infinispan Server Test Container].
ja_jp: ユニットテストのためにInfinispan Serverを起動するために、Quarkusは link:https://infinispan.org/docs/stable/titles/hotrod_java/hotrod_java.html#junit-testing[Infinispan Server Test Container] に依存する1つの `QuarkusTestResourceLifecycleManager` を提供します。

source: To start a Keycloak Server you can use Docker and just run the following command:
ja_jp: Keycloak サーバーを起動するにはDockerを使用し、以下のコマンドを実行するだけです。

source: To start a Keycloak Server, you can use Docker and just run the following command:
ja_jp: Docker を使用して次のコマンドを実行するだけで、Keycloak サーバーを起動できます。

source: To start a Keycloak server, use Docker and run the following command:
ja_jp: Keycloakサーバーを起動するには、Dockerを使用し、以下のコマンドを実行します:

source: To start a Keycloak server, use the following Docker command:
ja_jp: Keycloak サーバーを起動するには、以下の Docker コマンドを使用します。

source: To start a Keycloak server, you can use Docker and run the following command:
ja_jp: Keycloak サーバーを起動するには、Docker を使用して次のコマンドを実行します。

source: To start a Keycloak server, you can use Docker to run the following command:
ja_jp: Keycloak サーバーをが起動するには、Docker を使用して次のコマンドを実行します。

source: To start a MongoDB database for your unit tests, Quarkus provides two `QuarkusTestResourceLifecycleManager` that relies on link:https://github.com/flapdoodle-oss/de.flapdoodle.embed.mongo[Flapdoodle embedded MongoDB].
ja_jp: ユニットテスト用にMongoDBデータベースを起動するために、Quarkusは link:https://github.com/flapdoodle-oss/de.flapdoodle.embed.mongo[Flapdoodle embedded MongoDB]に依存する2つの `QuarkusTestResourceLifecycleManager` を提供しています。

source: To start a transaction, you use the `withTransaction` method. This method receives a `Consumer<TransactionalRedisDataSource>`, which follows the same API as the regular `RedisDataSource` except that the commands return `void` (`Uni<Void>` for the reactive variant). When that consumer returns, the transaction is _executed_.
ja_jp: トランザクションを開始するには、 `withTransaction` メソッドを使用します。 このメソッドは `Consumer<TransactionalRedisDataSource>` を受け取ります。これは、コマンドが `void` (リアクティブバリアントでは `Uni<Void>`) を返すことを除けば、通常の `RedisDataSource` と同じ API です。 そのコンシューマーが返されたとき、トランザクションは _実行_ されます。

source: To start an Infinispan Server for your unit tests, Quarkus provides one `QuarkusTestResourceLifecycleManager` that relies on link:https://infinispan.org/docs/stable/titles/hotrod_java/hotrod_java.html#junit-testing[Infinispan Server Test Container].
ja_jp: ユニットテスト用に Infinispan Server を起動するために、Quarkus は link:https://infinispan.org/docs/stable/titles/hotrod_java/hotrod_java.html#junit-testing[Infinispan Server Test Container] に依存する `QuarkusTestResourceLifecycleManager` を1つ提供します。

source: To start dev mode from the Quarkus CLI do:
ja_jp: Quarkus CLI から dev モードを起動するには、以下を実行します。

source: To start testing your extension, create the following `org.acme.greeting.extension.deployment.GreetingExtensionTest` test class:
ja_jp: エクステンションのテストを開始するには、次の `org.acme.quarkus.greeting.deployment.GreetingTest` テストクラスを作成します。

source: To start the application in recording mode, use the following:
ja_jp: レコーディングモードでアプリケーションを起動するには、以下を使用します。

source: To start using Flyway with your project, you just need to:
ja_jp: プロジェクトで Flyway を使い始めるには、以下のことを行う必要があります。

source: To start using Liquibase with your project, you just need to:
ja_jp: Liquibase をプロジェクトで使い始めるためには、以下のことを行う必要があります。

source: To start using the Liquibase MongoDB Extension with your project, you just need to:
ja_jp: Liquibase MongoDB エクステンションをあなたのプロジェクトで使い始めるには、以下が必要です。

source: To start with, you can register a custom `quarkus.oidc.TokenStateManager` and implement a required session state storage mechanism. For example, Quarkus OIDC does not ship an in-memory `TokenStateManager` because it does not really work after restarts or across multiple pods, but you can implement the one in order to start experimenting with the custom `TokenStateManager`.
ja_jp: まず、カスタムの `quarkus.oidc.TokenStateManager` を登録し、必要なセッション状態の保存メカニズムを実装できます。例えば、Quarkus OIDC は、再起動後や複数の Pod 間では実際には機能しないため、インメモリの `TokenStateManager` を同梱していませんが、カスタム `TokenStateManager` の試行を開始するために実装することは可能です。

source: To start, add the same dependency, `quarkus-test-oidc-server`, as described in the <<bearer-token-integration-testing-wiremock>> section.
ja_jp: まず、<<bearer-token-integration-testing-wiremock>> セクションの説明に従って、同じ依存関係 `quarkus-test-oidc-server` を追加します。

source: To stop the containers, use `docker-compose down`. You can also clean up the containers with `docker-compose rm`
ja_jp: コンテナを停止するには、`docker-compose down` を使用します。`docker-compose rm` を使用してコンテナをクリーンアップすることもできます。

source: To store binary data, use `byte[]`.
ja_jp: バイナリーデータを格納するには、 `byte[]` を使用します。

source: To store or retrieve binary data, use `byte[]`.
ja_jp: バイナリ・データを保存または取得するには、 `byte[]` を使用します。

source: To submit questions comment on this blog or the matching post in our https://github.com/quarkusio/quarkus/discussions/22852[GitHub Discussion forum] or post a tweet using the hashtag https://twitter.com/hashtag/quarkusinsights[#quarkusinsights].
ja_jp: 質問を投稿するには、 link:https://github.com/quarkusio/quarkus/discussions/categories/quarkus-blog-website[GitHubのディスカッションフォーラム]でこのブログやマッチした記事にコメントするか、ハッシュタグ link:https://twitter.com/hashtag/quarkusinsights[#quarkusinsights]をつけてツイートしてください。

source: To submit questions comment on this blog or the matching post in our https://github.com/quarkusio/quarkus/discussions/26740[GitHub Discussion forum] or post a tweet using the hashtag https://twitter.com/hashtag/quarkusinsights[#quarkusinsights].
ja_jp: ご質問は、このブログまたは https://github.com/quarkusio/quarkus/discussions/26740[GitHub Discussion forum]の該当記事にコメントいただくか、ハッシュタグ https://twitter.com/hashtag/quarkusinsights[#quarkusinsights] をつけてツイートしてください。

source: To supply your own css that override/enhance style in the html, you need to place a file called `style.css` in `src/main/resources/META-INF/branding`.
ja_jp: HTMLのスタイルをオーバーライド/強化する独自のCSSを提供するには、 `src/main/resources/META-INF/branding` の中に `style.css` というファイルを置く必要があります。

source: To supply your own logo, you need to place a file called `logo.png` in `src/main/resources/META-INF/branding`.
ja_jp: 独自のロゴを提供するには、 `logo.png` というファイルを `src/main/resources/META-INF/branding` に配置する必要があります。

source: To support `100-continue`, the `quarkus.http.handle-100-continue-automatically` option needs to be enabled explicitly For additional information check https://datatracker.ietf.org/doc/html/rfc7231#section-5.1.1[100-continue] and the related https://vertx.io/docs/apidocs/io/vertx/core/http/HttpServerOptions.html#DEFAULT_HANDLE_100_CONTINE_AUTOMATICALLY[Vert.x documentation].
ja_jp: `100-continue` をサポートするには、 `quarkus.http.handle-100-continue-automatically` オプションを明示的に有効にする必要があります。 詳細については、 link:https://datatracker.ietf.org/doc/html/rfc7231#section-5.1.1[100-continue] と 関連する link:https://vertx.io/docs/apidocs/io/vertx/core/http/HttpServerOptions.html#DEFAULT_HANDLE_100_CONTINE_AUTOMATICALLY[Vert.x ドキュメント] を参照してください。

source: To support some external libraries that are creating a `ValidatorFactory` using the default bootstrap, Quarkus returns the `ValidatorFactory` managed by Quarkus when `Validation.buildDefaultValidatorFactory()` is called.
ja_jp: デフォルトのブートストラップを使用して `ValidatorFactory` を作成している一部の外部ライブラリをサポートするために、Quarkus は `Validation.buildDefaultValidatorFactory()` が呼び出されたときに Quarkus によって管理されている `ValidatorFactory` を返却します。

source: To support the integration with such OAuth2 servers, `quarkus-oidc` needs to be configured a bit differently to allow the authorization code flow responses without `IdToken`: `quarkus.oidc.authentication.id-token-required=false`.
ja_jp: このような OAuth2 サーバーとのインテグレーションをサポートするには、 `quarkus-oidc` を少し異なる方法で設定して、 `IdToken`: `quarkus.oidc.authentication.id-token-required=false` なしで認可コードフローの応答を許可する必要があります。

source: To support this, extensions can declare a *headless component* — a web component with no visual representation that runs automatically on page load.
ja_jp: これをサポートするために、エクステンションは *ヘッドレスコンポーネント* を宣言できます。これは、視覚的な表現がなく、ページロード時に自動的に実行される Web コンポーネントです。

source: To test against a running instance that only accepts SSL/TLS connection (example: `https://1.2.3.4:4321`) set the system property `quarkus.http.test-ssl-enabled` to `true` and `quarkus.http.test-ssl-port` to the target HTTPS port.
ja_jp: SSL/TLS 接続のみを受け入れる実行中のインスタンス (例: `https://1.2.3.4:4321`) に対してテストするには、システムプロパティー `quarkus.http.test-ssl-enabled` を `true` に、`quarkus.http.test-ssl-port` をターゲットの HTTPS ポートに設定します。

source: To test against a running instance that only accepts SSL/TLS connection (example: `https://1.2.3.4:4321`) set the system property `quarkus.http.test-ssl-enabled` to `true`.
ja_jp: SSL/TLS 接続のみを受け入れる実行中のインスタンス (例: `https://1.2.3.4:4321`) に対してテストするには、システムプロパティー `quarkus.http.test-ssl-enabled` を `true` に設定します。

source: To test an `HttpFunction`, you can use this command to launch your function locally.
ja_jp: `HttpFunction` をテストするために、以下のコマンドを使用しローカルで関数を起動することができます。

source: To test asynchronous methods, add the test method below in `ExtensionsResourceTest`:
ja_jp: 非同期メソッドをテストするには、 `ExtensionsResourceTest` に以下のテストメソッドを追加します。

source: To test each constraint in isolation, use a `ConstraintVerifier` in unit tests. It tests each constraint's corner cases in isolation from the other tests, which lowers maintenance when adding a new constraint with proper test coverage.
ja_jp: 各制約を個別にテストするには、単体テストで `ConstraintVerifier` を使用します。各制約のコーナーケースを他のテストとは別にテストします。これにより、適切なテストカバレッジで新しい制約を追加する際のメンテナーンスが軽減されます。

source: To test if the current user has a specific role, the `hasRole` expression can be used inside `@PreAuthorize`.
ja_jp: 現在のユーザーが特定のロールを持っているかどうかをテストするには、 `hasRole` 式を `@PreAuthorize` 内で使用します。

source: To test that `updateProperties` executes correctly via JsonRPC, you can add a test that extends `DevUIJsonRPCTest`.
ja_jp: `updateProperties` が JsonRPC 経由で正しく実行されることをテストするには、 `DevUIJsonRPCTest` を拡張するテストを追加できます。

source: To test that your build time data is generated correctly, you can add a test that extends `DevUIBuildTimeDataTest`.
ja_jp: ビルド時データが正しく生成されていることをテストするには、 `DevUIBuildTimeDataTest` を拡張するテストを追加できます。

source: To test the application, open your browser and access the following URL:
ja_jp: アプリケーションの動作確認は、ブラウザを起動して以下のURLにアクセスしてください:

source: To test the application, you should open your browser and access the following URL:
ja_jp: テストするには、ブラウザを開いて以下のURLにアクセスする必要があります。

source: To test the capabilities of `FruitRepository` proceed to update the content of `FruitResourceTest` to:
ja_jp: `FruitRepository` の機能をテストするには、 `FruitResourceTest` のコンテンツを次のように更新します。

source: To test the capabilities of `FruitsRepository` proceed to update the content of `FruitsRepositoryTest` to:
ja_jp: `FruitsRepository` の機能をテストするために、 `FruitsRepositoryTest` のコンテンツを次のように更新します。

source: To test this out, do the following:
ja_jp: これを試すには、次のようにします。 :

source: To test your application using Curl or a browser start a PostgreSQL server first. Then, compile and run your application in either JVM or native mode.
ja_jp: Curlやブラウザを使用してアプリケーションをテストするには、まずPostgreSQLサーバを起動してください。 その後、JVMまたはネイティブモードでアプリケーションをコンパイルし、実行してください。

source: To test your application using Curl or the browser, you must first start a PostgreSQL server, then compile and run your application either in JVM or native mode.
ja_jp: Curl またはブラウザーを使用してアプリケーションをテストするには、まず PostgreSQL サーバーを起動し、次に JVM モードまたはネイティブモードのいずれかでアプリケーションをコンパイルして実行する必要があります。

source: To test your application, just send a request to the service with giving the person as JSON payload.
ja_jp: アプリケーションをテストするには、人をJSONペイロードとして指定してサービスにリクエストを送信するだけです。

source: To test your application, just send request to the service with giving the person as JSON payload.
ja_jp: アプリケーションをテストするには、人をJSONペイロードとして指定してサービスにリクエストを送信するだけです。

source: To test your final decision service application, just send a request to the endpoint by supplying as JSON payload the expected inputs:
ja_jp: ディシジョンサービスアプリケーションをテストするには、JSONペイロードとして期待される入力を提供して、エンドポイントにリクエストを送るだけです。

source: To test, run it by exposing port 80 into port 8080 in your host:
ja_jp: テストのときは、自分のホストでポート80を8080に公開して実行します。

source: To that end, you can use https://maven.apache.org/configure.html#maven_opts-environment-variable[`MAVEN_OPTS`]:
ja_jp: そのために link:https://maven.apache.org/configure.html#maven_opts-environment-variable[`MAVEN_OPTS`] が使用できます:

source: To this end, Quarkus provides a very convenient way of creating a native Linux executable by leveraging a container runtime such as Docker or podman. The easiest way of accomplishing this task is to execute:
ja_jp: このため、Quarkusでは、Dockerやpodmanなどのコンテナーランタイムを利用して、ネイティブのLinux実行ファイルを作成する非常に便利な方法を提供しています。このタスクを達成する最も簡単な方法は、次を実行することです:

source: To translate the extension description (taken from the <description> element of your runtime POM), define:
ja_jp: エクステンションの説明 (ランタイム POM の <description> 要素から取得) を翻訳するには、以下を定義します。

source: To trigger a build and deployment in a single step:
ja_jp: ビルドとデプロイを1つのステップでトリガーするためには次のようにします。

source: To trigger a container image build:
ja_jp: コンテナイメージのビルドをトリガーする場合:

source: To trigger an event to this function, you can use the `gcloud functions call` command:
ja_jp: この関数にイベントをトリガーするには、 `gcloud functions call` コマンドを使用します。

source: To trigger building and deploying a container image you need to enable the `quarkus.kubernetes.deploy` flag (the flag is disabled by default - furthermore it has no effect during test runs or dev mode). This can be easily done with the command line:
ja_jp: コンテナーイメージをビルドしてデプロイするには、 `quarkus.kubernetes.deploy` フラグを有効にする必要があります (このフラグはデフォルトでは無効になっています - さらに、テスト実行中や開発モードでは何の効果もありません)。これはコマンドラインで簡単に行えます。

source: To trigger the event, you can send a file to the GCS `example-cloud-event` bucket.
ja_jp: イベントをトリガーするために、GCS `example-cloud-event` のバケットにファイルを送信することができます。

source: To trigger the event, you can send a file to the GCS `quarkus-hello` bucket or you can use gcloud to simulate one:
ja_jp: イベントをトリガーするには、GCS `quarkus-hello` バケットにファイルを送るか、gcloudコマンドを使ってシミュレーションすることができます。

source: To trigger the event, you can send a file to the GCS `quarkus-hello` bucket, or you can use gcloud to simulate one:
ja_jp: イベントをトリガーするには、GCS `quarkus-hello` バケットにファイルを送るか、gcloudコマンドを使ってシミュレートします。

source: To trigger the event, you can send a file to the `hello_topic` topic or you can use gcloud to simulate one:
ja_jp: イベントをトリガーするには、 `hello_topic` トピックにファイルを送信するか、gcloudコマンドを使用してシミュレーションすることができます。

source: To trigger the event, you can send a file to the `hello_topic` topic, or you can use gcloud to simulate one:
ja_jp: イベントをトリガーするには、 `hello_topic` トピックにファイルを送信するか、gcloudコマンドを使用してシミュレートします。

source: To trust all certificates:
ja_jp: すべての証明書を信頼するには、次のように指定します。

source: To try it out, visit http://localhost:8080/hello?name=Bloom, and then http://localhost:8080/hello/names.
ja_jp: 試す場合は、 http://localhost:8080/hello?name=Bloom にアクセスしてから、 http://localhost:8080/hello/names にアクセスします。

source: To turn off the default tenant configuration, set `quarkus.oidc.tenant-enabled=false`.
ja_jp: デフォルトのテナント設定をオフにするには、`quarkus.oidc.tenant-enabled=false` を設定します。

source: To turn off the mock event server:
ja_jp: モック・イベント・サーバーをオフにする方法:

source: To understand how OptaPlanner is solving your problem internally, change the logging in the `application.properties` file or with a `-D` system property:
ja_jp: OptaPlanner が内部で問題をどのように解決しているかを理解するには、 `application.properties` ファイルまたは `-D` システムプロパティーのロギングを変更します。

source: To update an Author, retrieve it from the index, apply changes, retrieve the session's indexing plan and call `addOrUpdate`, passing the author instance in argument.
ja_jp: Author を更新するには、インデックスから Author を取得し、変更を適用し、 セッションのインデックスプランを取得して、author インスタンスを引数に渡して `addOrUpdate` を呼び出します。

source: To update the configuration, use `OidcTenantConfigBuilder` to create a new instance of `OidcTenantConfig` and modify it as required before returning it:
ja_jp: 設定を更新するには、`OidcTenantConfigBuilder` を使用して `OidcTenantConfig` の新しいインスタンスを作成し、必要に応じて変更してから返すようにします。

source: To update to Quarkus 3.20, we recommend updating to the latest version of the Quarkus CLI and run:
ja_jp: Quarkus 3.20 に更新するには、Quarkus CLI の最新バージョンに更新し、以下を実行することをお勧めします。

source: To update to Quarkus 3.27, we recommend updating to the latest version of the Quarkus CLI and run:
ja_jp: Quarkus 3.27 に更新するには、Quarkus CLI の最新バージョンに更新してから、以下を実行することをお勧めします。

source: To update to Quarkus 3.30, we recommend updating to the latest version of the Quarkus CLI and run:
ja_jp: Quarkus 3.30 にアップデートするには、Quarkus CLI の最新バージョンにアップデートし、以下を実行することをお勧めします。

source: To update to Quarkus 3.31, we recommend updating to the latest version of the Quarkus CLI and run:
ja_jp: Quarkus 3.31に更新するには、Quarkus CLIの最新バージョンに更新して、以下を実行することをお勧めします:

source: To update to Quarkus 3.32, we recommend updating to the latest version of the Quarkus CLI and run:
ja_jp: Quarkus 3.32 に更新するには、Quarkus CLI の最新バージョンに更新し、以下を実行することをお勧めします。

source: To update to Quarkus 3.33 LTS, we recommend updating to the latest version of the Quarkus CLI and run:
ja_jp: Quarkus 3.33 LTSにアップデートするには、Quarkus CLIを最新バージョンに更新して、以下を実行することをお勧めします。

source: To update to Quarkus 3.34, we recommend updating to the latest version of the Quarkus CLI and run:
ja_jp: Quarkus 3.34 に更新するには、最新バージョンの Quarkus CLI に更新し、次を実行することをお勧めします。

source: To update to Quarkus 3.4.2, we recommend updating to the latest version of the Quarkus CLI and run:
ja_jp: Quarkus 3.4.2にアップデートするには、Quarkus CLIの最新バージョンにアップデートして実行することをお勧めします：

source: To upgrade your application to Quarkus 3.0, see <<upgrading,the instructions below>>.
ja_jp: アプリケーションをQuarkus 3.0にアップグレードするには、 link:#upgrading[以下の手順] を参照してください。

source: To upload this image to your ACR, you must tag and push the image under the ACR login server. To find the login server of the Azure Container Registry, run this command:
ja_jp: このイメージをACRにアップロードするには、ACRログインサーバーの下にタグを付けてイメージをプッシュする必要があります。Azure Container Registryのログインサーバーを見つけるには、次のコマンドを実行します。

source: To upload, now do:
ja_jp: アップロードするには、次のようにします。

source: To use A2A Java SDK 1.0.0.Alpha2, add the appropriate dependencies to your project:
ja_jp: A2A Java SDK 1.0.0.Alpha2 を使用するには、プロジェクトに適切な依存関係を追加してください。

source: To use Alexa with Quarkus native, you need to use the https://github.com/quarkiverse/quarkus-amazon-alexa[Quarkus Amazon Alexa extension hosted at the Quarkiverse Hub].
ja_jp: Quarkus ネイティブで Alexa を使用するには、 https://github.com/quarkiverse/quarkus-amazon-alexa[Quarkiverse Hub でホストされている Quarkus Amazon Alexa エクステンション] を使用する必要があります。

source: To use AsciiDoc, the Javadoc comment must be annotated with `@asciidoclet` tag. This tag serves two purposes: it is used as a marker for Quarkus generation tool, but it is also used by the `javadoc` process for the Javadoc generation.
ja_jp: AsciiDocを使用するには、Javadocのコメントに `@asciidoclet` タグを付ける必要があります。このタグは、Quarkus生成ツールのマーカーとして使用されるだけでなく、Javadoc生成のための `javadoc` プロセスでも使用されるなど、2つの目的があります。

source: To use Compose Dev Services, you need:
ja_jp: Compose Dev Services を使用するには、次のものが必要です。

source: To use Dev Services, add the appropriate driver extension, such as `jdbc-postgresql`, for your desired database type to the `pom.xml` file. In dev mode, if you do not provide any explicit database connection details, Quarkus automatically handles the database setup and provides the wiring between the application and the database.
ja_jp: Dev Services を使用するには、 `pom.xml` ファイルに、希望するデータベースタイプに適したドライバーエクステンション (`jdbc-postgresql` など) を追加します。 開発モードでは、明示的なデータベース接続の詳細を記述しない場合、Quarkus が自動的にデータベースのセットアップを行い、アプリケーションとデータベース間の接続を行います。
